Documents/МНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МНО</Name>
			<BasedOn>
				<xr:Item>Document.Распоряжение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваМНО</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/МНО/Ext/ObjectModule.bsl
Процедура ЗаполнитьНаОснованииРаспоряжения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	Основание = ДанныеЗаполнения;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, СчетДоверительногоУправления, РасчетныйСчет, Процент, ДатаВозврата, Сумма");
	
	Если НачалоДня(ДанныеЗаполнения.Дата) = НачалоДня(ТекущаяДата()) Тогда
		// МНО под ожидаемый купон ставим к концу дня, т. к. купоны часто приходят под вечер
		Дата = ?(ДанныеЗаполнения.ПодОжидаемыйКупон, НачалоДня(ТекущаяДата()) + 19 * 60 * 60 + 50 * 60, ТекущаяДата());
	Иначе
		Дата = ДанныеЗаполнения.Дата;
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Брокер",                	    Справочники.БрокерскиеКомпании.ПустаяСсылка());
	ЭлементБлокировкиДанных.УстановитьЗначение("МестоХранения",                	Справочники.МестаХранения.ВнебиржевойРынок);
	ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет",                	ЭтотОбъект.РасчетныйСчет);
	ЭлементБлокировкиДанных.УстановитьЗначение("Валюта",                		ЭтотОбъект.РасчетныйСчет.Валюта);
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваМНО");

	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет",                	ЭтотОбъект.РасчетныйСчет);

	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ДенежныеСредстваМНО.Записывать = Истина;
	
	// зафиксируем блокировку денежных средств
	Движение = Движения.ДенежныеСредстваМНО.ДобавитьПриход();
	
	Движение.Период                       = ЭтотОбъект.Дата;
	Движение.Организация 				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.РасчетныйСчет 				  = ЭтотОбъект.РасчетныйСчет;
	Движение.МНО   					      = ЭтотОбъект.Ссылка;
	Движение.Сумма                        = ЭтотОбъект.Сумма;
	
	// зафиксируем отмену блокировки (раньше это делалось в приходе % МНО, но
	// как оказалось, приход % может быть и вечером, а деньгами можно пользоваться
	// уже с утра)
	Движение = Движения.ДенежныеСредстваМНО.ДобавитьРасход();
	
	Движение.Период                       = ЭтотОбъект.ДатаВозврата;
	Движение.Организация 				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.РасчетныйСчет 				  = ЭтотОбъект.РасчетныйСчет;
	Движение.МНО   					      = ЭтотОбъект.Ссылка;
	Движение.Сумма                        = ЭтотОбъект.Сумма;
	
	Движения.Записать();
	
	// проверим наличие доступного остатка д/с
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ОстаткиДенежныхСредств.ОстатокДенежныхСредств) КАК ОстатокДенежныхСредств,
		|	СУММА(ОстаткиДенежныхСредств.МНО) КАК МНО
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК ОстатокДенежныхСредств,
		|		0 КАК МНО
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И РасчетныйСчет = &РасчетныйСчет
		|					И МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|					И Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)) КАК ОстаткиДенежныхСредствОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		ДенежныеСредстваМНООстатки.СуммаОстаток
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И РасчетныйСчет = &РасчетныйСчет) КАК ДенежныеСредстваМНООстатки) КАК ОстаткиДенежныхСредств
		|
		|ИМЕЮЩИЕ
		|	СУММА(ОстаткиДенежныхСредств.ОстатокДенежныхСредств) < СУММА(ОстаткиДенежныхСредств.МНО)";
	
	// Остатки проверяем на конец дня, т. к. иначе условия МНО могут нарушиться
	Запрос.УстановитьПараметр("Период",                       Новый Граница(КонецДня(ЭтотОбъект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("РасчетныйСчет",                ЭтотОбъект.РасчетныйСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='На р/счете недостаточно денежных средств. Требуется " + ЭтотОбъект.Сумма + ". В наличии: " + Выборка.ОстатокДенежныхСредств + ", в т.ч. в МНО: " + (Выборка.МНО - ЭтотОбъект.Сумма) + ".'"), ЭтотОбъект, "Сумма",, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	Если НастройкиУчета.БлокироватьДенежныеСредстваПоДоговоруМНО Тогда
		
		// "заблокируем" ДС на том же счете, но на аналитике МНО
		Валюта = ЭтотОбъект.РасчетныйСчет.Валюта;
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		АналитикаМНО = Справочники.ДополнительныеАналитикиЛицевыхСчетов.МНО;	
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Признание соглашения МНО");
		
		Если Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк,Дата) Тогда
			Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета01;
		Иначе
			Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета02;
		КонецЕсли;
		Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.МНО;
		
		Проводка.ДополнительнаяАналитикаДт = АналитикаМНО;
		
		Проводка.ВалютаДт  = Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		
		Проводка.СчетКт = Проводка.СчетДт;
		Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.МНО;
		
		Проводка.ВалютаКт  = Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
	
	КонецЕсли;
	
КонецПроцедуры //ПроведениеПоРегиструЕПС

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт 
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Распоряжение") Тогда
			
		ЗаполнитьНаОснованииРаспоряжения(ДанныеЗаполнения, СтандартнаяОбработка);
	
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "ДатаВозврата, Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ПометкаУдаления Или Не ЗначениеЗаполнено(Основание) Тогда
	
		Возврат;
	
	КонецЕсли; 
			
	Если Не ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчет.ДоговорМНО) Тогда
		
		ДатаНачалаКонтроляДоговоровВМНО = ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "ДатаНачалаКонтроляДоговоровВМНО", ЭтотОбъект.Организация);
		
		Если ЗначениеЗаполнено(ДатаНачалаКонтроляДоговоровВМНО) И ДатаНачалаКонтроляДоговоровВМНО <= ЭтотОбъект.Дата Тогда
			ПроверяемыеРеквизиты.Добавить("Договор");
		КонецЕсли;
		
	КонецЕсли;
	
	ДатаВозвратаСоответствуетУсловиямДоговор(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
					
		РаботаСДокументами.ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииРаспоряжения(ЭтотОбъект, Отказ); 
		
		//проверим настройки акцептования - если требуется акцепт распоряжения на МНО, нельзя создавать МНО без распоряжения.
		Если РаботаСДокументами.ТребуетсяАкцептованиеДокумента(ЭтотОбъект.Основание, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата) Тогда	
			
			ТекстСообщения = "Перед созданием документа МНО необходимо " + ?(ЗначениеЗаполнено(ЭтотОбъект.Основание), "", "создать и ") + "акцептовать распоряжение на МНО";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Основание",, Отказ);
			
		КонецЕсли;
			
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЭтотОбъект.Дата > ЭтотОбъект.ДатаВозврата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата возврата МНО меньше даты документа", ЭтотОбъект, "ДатаВозврата",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти

Процедура ДатаВозвратаСоответствуетУсловиямДоговор(Отказ)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРасторжения = РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(ЭтотОбъект.Договор, "ДатаРасторжения", ЭтотОбъект.Дата).ДатаРасторжения;
	
	Если ЗначениеЗаполнено(ДатаРасторжения) И ДатаРасторжения < ЭтотОбъект.ДатаВозврата Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата возврата МНО позже даты расторжения договора (" + Формат(ДатаРасторжения, "ДФ=dd.MM.yy") + ").", ЭтотОбъект, "ДатаВозврата",, Отказ);
	КонецЕсли;	
	
КонецПроцедуры
